[
	{
		"name": "Princess Pearl",
		"time": "4 AM (ish)",
		"place": "New York",
		"description": "It was a serial killer's grand opening. He has kidnapped over 500 men and women, all from different places around Orange County, and placed them within a large abandoned underground mall in an undisclosed location. Everyday he broadcasts what goes on within the mall on Youtube. He has created a sort of game where the guests must kill two people per day or they themselves or a loved one will be killed. Each day the number of people you must kill goes up exponentially until every single person must kill another person. This goes on for months, the FBI and police are unable to figure out where they are being held or who is controlling this. Eventually, those that are left have become so accustomed to the killing that they enjoy it now and view it as a fun game and have developed their own rules and groups. The citizens have become completely unrecognizable.",
		"meaning": "Serial Killers in dreams can often be manifestations of unconscious fears that keep making the same negative patterns in your life. Serial Killers encourage the dreamer to find what dangerous behaviors they keep repeating. To dream of a killing spree may suggest you are angry and frustrated with others around you. Dreams from other people’s perspectives are quite common, especially when you are interested in other people’s perspectives or need to broaden your own. Your subconscious might be trying to project yourself into situations that this person may currently be in (either literally or figuratively) and seeing how you respond in a similar situation."
	},
	{
		"name": "Orchid Glasses",
		"time": "5 AM (ish)",
		"place": "Paris, France",
		"description": "I was in a ski gondola and one of my skis fell from where they were held- traumatized.",
		"meaning": "Dreams of unintentionally losing things often reflect an internal lack of control within your life. Traditionally, snow represents winter and the end of the growing season. During this season the top layers of the soil are completely frozen, no new growth can penetrate the surface. The reason why snow is symbolic and appears in many people’s dreams every month brings your attention to areas that are stuck. The dream reflects new growth, unable to penetrate due to some blockage in your life."
	},
	{
		"name": "Princess Pearl",
		"time": "7 AM (ish)",
		"place": "New York",
		"description": "My family and I went on a vacation to Egypt. We had to take single person minecarts to get to each location and I kept jumping out because I was distracted by shiny rocks. We got to our first destination, which was a super old Egyptian temple. My brother took a picture of me posing in front of a really pretty wall.",
		"meaning": " A temple like a church becomes an image of your own personal belief systems or principles that you abide by in life. A place that may represent the place of worship, but also a place of purification of your soul. If you are cleaning the temple it suggests cleansing the cognitive dissidence that was once present in your mind. It is also common to dream of a temple falling or breaking that show a weakness in the structure you built. If you visit Vishnu in the temple it might be connected to your higher self or an actual vision."
	},
	{
		"name": "Cherry Street",
		"time": "3 AM",
		"place": "California",
		"description": "I have a lot of dreams involving trying to eat corn but then my teeth keep falling out before I can take a bite. ",
		"meaning": "Teeth are enigmatic dreams symbols that often point towards some sort of loss in our lives. This is why many people associate losing teeth in their dreams and death. While this could be true it is not always the case. In fact most dental dreams symbolize our insecurities, inner weaknesses, poor communication, or a loss of control in your life. According to psychologist Carl Jung, Dreaming about your Teeth Falling Out can be a sign of a major transition or rebirth taking place in your life. If you were struggling to pull out a broken tooth it can alter the meaning. Pulling your own teeth might also bring your attention to speech or lack thereof.  It would mirror trying to force something out of you that you don’t want to admit within yourself."
	},
	{
		"name":"Princess Pearl",
		"time":"11 AM",
		"place":"California",
		"description":"I met Paul Rudd while skiing outside of some fancy winter houses. He and his family were all preparing for Halloween so they were dressed up in cool costumes and people kept coming up to their house. I skied to Paul Rudd's house and he was dressed as a mammoth. He started talking to me and I was like “huh this guy sounds like Paul Rudd”. We took a bunch of selfies on my phone, then he took out his phone and took selfies with me again.",
		"meaning":"Celebrities that appear in dreams represent our own desires to be noticed, or relating to our own unacknowledged potential that needs to be explored. The specific celebrity that appears in your dream contains hidden elements that alternatively are found within the dreamer.There are not just celebrities but can be images of what you truly want to become as it lacks within A common dream of hanging out with or being friends with a celebrity can be understood more with the exact celebrity you dream of. You will have to decide if this dream is a wishful fantasy,  a craving for attention and notification of others, or reflecting advancement in your life. Starting new jobs or possibly advancing quickly to become noticed might be reflected on this famous person."

	},
	{
		"name": "Lace Jones",
		"time": "9 AM (ish)",
		"place": "Toronto",
		"description": "I was left in charge of herding 30 mini ponies through an overnight camps talent show.",
		"meaning": " Horses similar to dogs, are both synonymous with our unconscious instinctual drives and urges. Something that was once wild is now domesticated, a representation of your own inner power that has the potential to become very powerful. Negative associations with the horse encourages the dreamer to investigate some of these repressed or uncontrolled desires. Your interaction with the horse determines if these urges are personally tamed or wild. Your conscience being in charge of these creatures signifies needing to take control of the seemingly “untameable” parts of life."
	},
	{
		"name": "Princess Pearl",
		"time": "10 PM (ish)",
		"place": "New York",
		"description": "I had a dream that I was best friends with Nick Jonas, except he liked me more than I liked him. I was walking through New York and every time I turned a corner he would be there and run at me with open arms and go “EYYY YOUUUUU!!!” in like a really bad chicago accent. It was also around Christmas time so New York was decked out with Holiday decorations.",
		"meaning": "Celebrities that appear in dreams represent our own desires to be noticed, or relating to our own unacknowledged potential that needs to be explored. The specific celebrity that appears in your dream contains hidden elements that alternatively are found within the dreamer.There are not just celebrities but can be images of what you truly want to become as it lacks within A common dream of hanging out with or being friends with a celebrity can be understood more with the exact celebrity you dream of. You will have to decide if this dream is a wishful fantasy,  a craving for attention and notification of others, or reflecting advancement in your life. Starting new jobs or possibly advancing quickly to become noticed might be reflected on this famous person."
	},
	{
		"name": "Doctor Sprinkles",
		"time": "9 AM",
		"place": "Santa Barbara",
		"description": "Recurring nightmare where I am forced to go through an incinerator",
		"meaning": "When fire emerges in our dreams it can either pose a warning or reflect that the dreamer will undergo some sort of inner transformation in their lives. In a positive light fire in our dreams is a symbolic image hinting at destruction of your old aspects in order for the new to flourish. Its ability to illuminate and transform the dreamer will reflect purification of this new energy that you will require. Due to its unpredictable and dangerous nature it can also become a symbol that is highly destructive if it isn’t controlled. Fire encourages the dreamer to explore emotions that are not fully understood yet, perhaps consuming them relating to anger, jealousy, rage or desire that are unconscious. One of the most common dream symbols that tend to appear are both houses and buildings. A powerful image that often reflects the inner architecture of the mind dreamer; a metaphoric substructure of things built and developed over time. This is why when fires emerge in either a house or building it shows that some shift, event or change is about to happen. But where exactly? In most cases inside the house or building each individual floor, room or lower levels often contain its own meaning where this shift or warning is taking place. For example, if the dreamer notices a fire in the bedroom it will point them towards relationships, past childhood experiences, sexual, unconsciousness that is not being made conscious.Alternatively, a fire in your house or a building may indicate new growth or change in our personality, viewpoints, consciousness or behaviors. Fire's unique ability to completely alter what it is in contact with,  so one can depict big changes on the horizon.  If the dreamer notices a Building On Fire it usually relates to “structures” that have been built over the years that are now destroyed. This might mirror relationships, ideals, principles, goals, beliefs or values."
	},
	{
		"name": "Street Cherry",
		"time": "4 AM",
		"place": "California",
		"description": "In middle school, a lot of my dreams revolved around the Walking Dead because I would binge it a lot with my dead. One time I dreamt my mom was turning into a zombie and my dad kept yelling at me to kill her.",
		"meaning": "These brain-oriented flesh eating monsters deliver an important metaphorical message warning the dreamer about something inhuman in human form. Zombies in dreams represent the people who have a decreased level of dopamine in the prefrontal cortex. In fact you might know a couple of zombies in your life. You know the ones who are controlled by limited beliefs, unconscious behaviors, addictions or urges… Maybe you had a glimpse of some fools trampling an old lady to save 15% on a flat screen T.V during a black Friday sale. Or you may be watching too much TV!"
	},
	{
		"name": "Princess Pearl",
		"time": "8 AM (ish)",
		"place": "New York",
		"description": "I dreamt of bright red fields of straw and a deep blue sky. Buried somewhere within China. I conjured up strong wills. We walked for a thousand miles. The ones we passed all knew what we were here for. They didn’t judge us, just watched. His mind was made up but I secretly hoped that I would be enough to change it. My mother was so scared and tired but we knew this was important. Too scared to say no to a man who knew this was what he wanted.",
		"meaning": "Two things in life are certain. Death and taxes. Believe it or not dying in dreams actually has nothing to do with you dying, but rather relating to abrupt endings, transformations or rebirths in your life. Your unconscious speaks to you in a metaphoric language using the theme “dying” as something that used to be, that is no longer. Dreaming about yourself dying might actually be considered a positive thing relating to a major shift taking place in your life. In fact your unsettling dying dream might be a symbolic goodbye to a relationship, a job, or a change of identity – the ego dies all the time only to be reborn again. Maybe on an unconscious level there might be a part of you that is dying or trying to remove yourself from. If you are dreaming about others dying, specifically loved ones, take it as a sign to show them how much you love them! You may not be showing appreciation for your loved ones as much as you would like and you subconsciously feel guilty."
	},
	{
		"name": "Eyelash Cottage",
		"time": "10 AM",
		"place": "New York",
		"description": "I had a dream that I was paving my driveway with tar but then it was time to go to prom so my dad drove me but a few minutes I realized I wasn’t wearing shoes or a corsage and he wouldn’t turn back so I started crying.",
		"meaning": "Dreams like this may be a result of not feeling properly prepared for the events or situations taking place in your daily life. They also may be a result of not taking control of things in your life."
	},
	{
		"name": "Street Cherry",
		"time": "11 PM",
		"place": "California",
		"description": "My friends and I were staying in this massive AirBnb mansion. While exploring, we found out the mansion connects to a mall. We walked out the door, and there was a mall!",
		"meaning": "Mansions are very symbolic dreams like houses that represent a part of the mind – a powerful and rich structure built connected to finance, consciousness, knowledge and ego. How the mansion is displayed becomes a mirror image of what is behind the scenes in your mind. Positive dreams are often related to inheriting or seeing a luxurious mansion as it shows a powerful inner drive that reaches for success. A haunted mansion reflects an unconscious disturbance in your mind that relates to success or image. Dreaming of a mansion with many rooms is a very positive omen that represents new opportunities, growth and development in their lives."
	},
	{
		"name": "Blues Lawrence",
		"time": "6 AM",
		"place": "California",
		"description": "I was at UC Santa Cruz visiting my friend, but I was also shadowing there as a film student too for some reason. The entire campus was a mic of Great America and Santa Cruz beach boardwalk instead of a normal campus. Also, for some reason my film professors were the humanoid versions of Wendy’s and Burger King mascots. They eventually took us to this theater to watch some movie, and then in the middle of the screening all the other kids in my class I was shadowing for, turn around in their seats and remove their skin and suddenly there’s like 10 mini Ronald McDonald’s staring at me with the intent to kill. BUT THEN, the movie theater we were at suddenly starts falling because we were on a plane now for some reason and we end up crashing into the ocean.",
		"meaning": "In short, dreams about skin represent the protective barriers between you and the world that you interact with. Skin becomes a metaphoric symbol that mirrors parts of your identity in which you display to others which is always hidden from the dreamer. Interestingly enough, the emotions expressed  in your dream suggests whether you are a thick or thin skinned person pertaining to a particular matter. In most cases dreams about our skin tend to be extremely vivid or grotesque themes that often make you wonder if you are starring in a horror movie. Dreaming of your skin peeling represents exploring a problem one layer (step) at a time, to thoroughly understand what’s causing the trouble. A symbol that tells the dreamer to find better ways to protect themselves in toxic environments or to be less thin skinned as its getting to you mentally. Plane crash dreams might be unexpected as you are not in control of the plane. Alternately, the unpredictability of life throws us for loops and holds us back from advancing at times. Does this suggest something bad is going to happen in the future? Not necessarily, but you should be aware that you might encounter a minor setback or change."
	},
	{
		"name":"Princess Pearl ",
		"time":" 6 AM",
		"place":"New York",
		"description":"I dreamt that it was suddenly the apocalypse and I lived in a small rural town in the country. My friends and I were all trying to survive together. We went scavenging for supplies one day and came across a family of boys who used to wreak havoc on the town. They all sat down in lawn chairs outside their trailer, disfigured and oozing. Somehow they were still able to croak out racist and sexist remarks at us. They told us how they wanted to leave but couldn’t leave their father behind. I turn to see their father, half his limbs decayed away and foaming at the mouth. He was barely sentient. Then their adorable dog came out of nowhere. But now he looked different. He used to be super strong looking, a perfect white labrador. But now his belly hung low to the ground and honeycomb structures emerged from his ribs and head. He saw me and ran to me. I remember we used to play in the fields when I got out of school and the men were at work or drinking. He remembered me. He ran up to me whimpering both out of fear and joy. His whimpers rang through my ears. I could tell how scared he was. It was like I could read his mind. All I could say was “I wish it was better. You deserve better”.",
		"meaning":"These brain-oriented flesh eating monsters deliver an important metaphorical message warning the dreamer about something inhuman in human form. Zombies in dreams represent the people who have a decreased level of dopamine in the prefrontal cortex. They can represent binge eating, a lack of self control, addictions, consumerism, and more. A dog is a powerful symbol of understanding, unconditional love and true companionship. Dogs are commonly associated with Powerful Emotions, a connection with self preservation, knowledge while bringing us comfort during difficult times in our lives. Even though they might attack they are there to help direct you to find what you are looking for. Before you analyze your dog dream you first must understand how your dream is communicating with you. Someone who might not be a dog lover would react differently than someone who hates dogs. Furthermore, dreaming of your dog or a previous dog might be connected to memories, or just sheer missing their company."

	},
	{
		"name":"Tangerine Dream",
		"time":"4 AM",
		"place":"Irvine",
		"description":"One time I had a dream I was at home getting groceries and my mom also asked me to get wine. But Trader Joe’s took my fake ID and called the police so I ran away.",
		"meaning":"Police dreams represent power, control, and regulations. It frequently indicates that you are having problems with your boss, teachers, or parents. It could also be a sign that you need advice and support. If you experienced this dream, it’s a sign that you should muster up the guts and take charge of your life. In general, encountering police in a dream or being stopped by them can signify guilt or apprehension about punishment. Moreover, it could mean that someone needs protection or authority. The need for structure and order in one’s life and a desire to protect morality and justice can be represented by dreams involving police."

	},
	{
		"name":"Glitter Glue",
		"time":"10 AM",
		"place":"New York",
		"description":"I had a dream that my childhood stuffie burned down my house.",
		"meaning":"A dream about a stuffed animal or cuddly toy represents immaturity, security, love, comfort, support and unconditional or unquestioned love. You are trying to escape from your daily responsibilities and problems. A dream about a stuffed animal may also indicate that you need to relax and be less serious or serious. You need to let the stress slip away from you. When fire emerges in our dreams it can either pose a warning or reflect that the dreamer will undergo some sort of inner transformation in their lives. In a positive light fire in our dreams is a symbolic image hinting at destruction of your old aspects in order for the new to flourish. Its ability to illuminate and transform the dreamer will reflect purification of this new energy that you will require. Due to its unpredictable and dangerous nature it can also become a symbol that is highly destructive if it isn’t controlled. Fire encourages the dreamer to explore emotions that are not fully understood yet, perhaps consuming them relating to anger, jealousy, rage or desire that are unconscious. One of the most common dream symbols that tend to appear are both houses and buildings. A powerful image that often reflects the inner architecture of the mind dreamer; a metaphoric substructure of things built and developed over time. This is why when fires emerge in either a house or building it shows that some shift, event or change is about to happen. But where exactly? In most cases inside the house or building each individual floor, room or lower levels often contain its own meaning where this shift or warning is taking place."
	},
	{
		"name":"Doggy Daycare",
		"time":"11 AM",
		"place":"California",
		"description":"I have a recurring dream where I am in an amusement park and all the attractions and characters come to life and chase me. One time King Kong was chasing me for like an hour and I had to hide in a coffin shaped water ride with Dracula.",
		"meaning":"Maybe this dream symbol could be an indication you might need some time for some R & R. Is your life boring right now and need some excitement? Could the dream mean that you could be taken for a ride? On the opposite hand, you may be having too much fun and it is beginning to overwhelm you. Try taking more time to really be with yourself and enjoy your own presence."
	},
	{
		"name":"Princess Pearl",
		"time":"3 AM",
		"place":"New York",
		"description":"I dreamt that there was a nationwide random lottery to be sent into space and I had won. They flew me out to a massive oil rig style structure in the middle of the ocean. The waves were huge and crashing all around us but the sky was clear blue. There were press and photographers everywhere but I wasn’t allowed to talk to them. The scientists/astronauts walked me to a large pipe near the edge of the center of the platform. There were several other people who also won the lottery near me, all standing near a pipe. We heard a gunshot and they all were forced to jump into the pipe. I then realized that scientists had found a safe portal to space hidden in the ocean and we were testing them out. I crawled into the pipe upside down, like crawling to a jungle gym tube, and suddenly the world flipped right side up and I was falling millions of miles into pure black. Then my falling got slower and I began to swim downwards into millions of stars and galaxies. Bright neon reds, blues, and purples swirled around me as stars danced around my fingers. It was never ending and each galaxy and color merged into each other perfectly symmetrically. That’s all I remember but it was so pretty.",
		"meaning":"Space can represent everything from the expanse of our universe to the area within a small box. Below we’ll break down the dream analysis for dreams of outer space, small spaces, and empty spaces. A dream of outer space could include traveling by spaceship, launching into orbit, exploring a planet, or floating around in a space suit. These dreams are usually filled with anticipation, adventure, and new sights to explore. The majority of outer space dreams provide positive context and are a good omen of what’s to come in your waking life. You seem to have a spirit of adventure – be it conscious or not – and are willing to take on new journeys should they come your way. Humans have only explored around 5% of outer space, leaving 95% undiscovered. This is why dreams about outer space or our galaxy show that you are curious about new experiences and want to learn more about the unknown. Now is the time to try out that hobby you’ve always been curious about, sign up for a new class, or take on a different professional role in a setting you’ve never worked in."

	},
	{
		"name":"Beachy Bear",
		"time":"7 AM",
		"place":"California",
		"description":"I drowned in dog shit",
		"meaning":"For the most part drowning seems to be related to your emotional state of mind. Why? Because we are dealing with a body of water that connects us towards what is below the surface of these feelings and emotions that overwhelm us. Remember that some people struggle to get out, some remain in limbo, while others are consumed by the water eventually killing them. Even the color of the water helps determine your clarity of this situation. Drowning in dreams metaphorically reflects when or if you will rise above this personal issue. The act of drowning in feces can be related back to embarrassment. Are you too embarrassed to ask for help?"

	},
	{
		"name":"Crochet Carrot",
		"time":"6 AM",
		"place":"California",
		"description":"CalifornMy friend and I were going on a trip together to Palm Springs and were showing each other the clothes we packed. He showed me a pair of jorts and I started crying.ia",
		"meaning":"You really don’t like jorts."

	},
	{
		"name":"Princess Pearl",
		"time":"3 AM",
		"place":"California",
		"description":"I had a dream that my parents were going out of town so I had to stay at our neighbors house while they were gone. In the house lived the two parents, who were kind, funny, and outgoing (the perfect “cartoon” parents), and their daughter who was about a year younger than me. She had pale skin and short block hair with bangs, and always wore striped tights. During the day we would play in her backyard and pretend it was an amusement park and run around collecting daisies. Then the night came. At dinner, the daughter went to use the restroom. The parents whispered to me that when we go to bed I should never leave the room and never face their daughter while sleeping or look her in the eye. She came back and we headed off to sleep. We shared a bed with her on the left and me on the right. I couldn’t sleep and began tossing and turning. I turned to face her and woke up to her giant eyes staring into mine. I began apologizing profusely. She started to chant weird words. I got out of bed and started running. Suddenly my body was paralyzed and my spine began to sting. I mustered up the strength to turn around to find her holding out her hand, with her eyes glowing green. She kept mumbling words. “You shouldn’t have done that”. Her parents came barging out of their rooms but they looked different. They looked sickly and green, stumbling over each other in a daze. I realized that she had put them under a spell. Then they began to eat me with tears in their eyes. I woke up.",
		"meaning":"When we metaphorically think of the act of consuming another individual of the same species as food we must pay attention to our surroundings. To dream of being eaten alive suggests whoever is feeding off of your energy remains unconscious, though may receive clues such as locations, specific emotions, and where they might be interested in eating you first. Locations help pinpoint the root of the problem. For example, to dream of being eaten alive at work usually points towards your coworkers, whereas in your house connects the person to the psyche/mind or inner architecture; a symbol that implies your behaviors or cravings end up devouring you in the long run."

	},
	{
		"name":"Doggy Daycare",
		"time":"11 AM",
		"place":"California",
		"description":"I had a dream that I was coming back to work for the first time after Spring Break and they had just installed a massive two part aquarium right in the lobby. On one side there was a whale and a bunch of small fish and on the other side there were sea lions, an orca, and a leopard seal (the aggressive kind). My boss told me I had to feed and clean their tank but I didn’t know how so he just said I had to give them water and feed them. He made me take a bucket and pour water in the tank every hour. Then, I had to feed them. But since I didn’t know how I asked my coworker. He went to feed them but then he fell into the tank and the leopard seal ate him. Then when I tried to feed the creatures I fell in also. I befriended a nice sea lion and he let me ride on his back to evade the leopard seal who was chasing us.",
		"meaning":"Fish in dreams are usually positive omens that have been around for thousands of years in many different cultures.  When fish appear in our dreams they contain hidden messages relating to luck, abundance, joy, rebirth, higher self, unknown and creativity. Connecting the dreamer to their emotions that might not be fully understood, the depths of our soul, deeper awareness of the unconsciousness or higher self. We must remember that fish are also cold-blooded, not driven by passion but survival, and often represent people. Fishes are a very common dream symbol, however depending the type of fish and how you interact with it alters the meaning of your dream. The fishes and colors you see in the aquarium help puzzle the meaning of the dream.  If you were to see Nemo for example it might suggest you found something that you have been searching for.  To dream of a small amount of fish inside the aquariums, suggests that your awareness of the inability to pursue meaningful romantic interests.  If you notice that the aquarium is empty, dreams reflect a lack of emotional involvement with your world. You are not aware nor do you care about how many issues are affecting you.  If it is dirty suggests a need to clean or change the negative thought patterns."
	},
	{"name": "Doctor Sprinkles",
		"time": "7 AM",
		"place": "Santa Barbara",
		"description": "I had a dream that I have breast cancer.",
		"meaning": "Cancer in dreams may in fact be related to unconscious fears of dying or repressed emotions stemming from the people we have lost to this deadly disease. Alternatively, cancer dreams could also be acting as a warning- if you suspect you are not feeling like you normally do- it might be time to pay a visit to your doctor to get checked out just in case. Certain cancers will help determine where the root of the problem is found, though in a metaphoric sense.  An example: brain cancer would be a reflection of the mind/psyche, or negative thought patterns. The people around you, location and who is telling you are clues that bring you closer to the meaning. The type of cancer and the location plays a key role in your dream. Cancer in dreams can be enigmatic and might take some time to decode. We can provide you with some possible hints on what the dream could be telling you. You can also explore the 7 chakras energy centers and match it to the area where the sickness might be originating."
	},
	{
		"name":"Princess Pearl",
		"time":"9 AM",
		"place":"California",
		"description":"I dreamt that I was laying in a bed with a man next to me. The bed was coated in sunlight and warm rays but the space around us was a soft blue. There was a window and all you could see were stars. I was not sure who the man was but we talked for a while like we knew each other already. Then he suddenly got out of bed. The bed began to turn blue and the mood became cold and lonely. I try to get out of the bed but it is never ending, the same fabric keeps repeating over and over as I try to crawl out. I finally get out and reach for his back, wrapping my arms around him fully. I look around the room and it is a child’s room with small wooden toys scattered around. I look outside the window and see a massive moon right next to us. We are floating in space. The sheer sparkly curtains around the windows start to move, spiraling with the wind. As I hold onto him tighter, the man's body begins to shrink while all his clothes delicately melt off of him like petals. He crumbles into a small skeleton just slightly larger than my hands.",
		"meaning":"The majority of outer space dreams provide positive context and are a good omen of what’s to come in your waking life. You seem to have a spirit of adventure – be it conscious or not – and are willing to take on new journeys should they come your way. HNow is the time to try out that hobby you’ve always been curious about, sign up for a new class, or take on a different professional role in a setting you’ve never worked in. If you are dreaming of a person you have never met, your subconscious is telling you that deep down you are feeling lonely."

	},
	{
		"name":"Doggy Daycare",
		"time":"6 AM",
		"place":"California",
		"description":"I had a dream that my high school was actually a school for squirrels and they all kept trying to get me to buy them cashew nuts.",
		"meaning":"You might not think these cute spastic rodents actually contain spiritual elements to it, but due to the fact they are closely associated with trees we must look closer into this strange connection. Generally speaking, trees show up in our dreams pointing to the spiritual growth of the dreamer Carl Jung, considered the iconic image of the tree relating to life, wisdom, hidden knowledge and prosperity. The biblical meaning of a squirrel in your dream represents putting in hard honest work so it can pay off in the future. Even though squirrels are not mentioned in the bible you should metaphorically deconstruct the meaning similar to the parables in the verses."

	}
]
