[
	{
		"name": "Princess Pearl",
		"time": "4 AM (ish)",
		"place": "New York",
		"description": "It was a serial killer's grand opening. He has kidnapped over 500 men and women, all from different places around Orange County, and placed them within a large abandoned underground mall in an undisclosed location. Everyday he broadcasts what goes on within the mall on Youtube. He has created a sort of game where the guests must kill two people per day or they themselves or a loved one will be killed. Each day the number of people you must kill goes up exponentially until every single person must kill another person. This goes on for months, the FBI and police are unable to figure out where they are being held or who is controlling this. Eventually, those that are left have become so accustomed to the killing that they enjoy it now and view it as a fun game and have developed their own rules and groups. The citizens have become completely unrecognizable.",
		"meaning": "Serial Killers in dreams can often be manifestations of unconscious fears that keep making the same negative patterns in your life. Serial Killers encourage the dreamer to find what dangerous behaviors they keep repeating. To dream of a killing spree may suggest you are angry and frustrated with others around you. Dreams from other people’s perspectives are quite common, especially when you are interested in other people’s perspectives or need to broaden your own. Your subconscious might be trying to project yourself into situations that this person may currently be in (either literally or figuratively) and seeing how you respond in a similar situation."
	},
	{
		"name": "Orchid Glasses",
		"time": "5 AM (ish)",
		"place": "Paris, France",
		"description": "I was in a ski gondola and one of my skis fell from where they were held- traumatized.",
		"meaning": "Dreams of unintentionally losing things often reflect an internal lack of control within your life. Traditionally, snow represents winter and the end of the growing season. During this season the top layers of the soil are completely frozen, no new growth can penetrate the surface. The reason why snow is symbolic and appears in many people’s dreams every month brings your attention to areas that are stuck. The dream reflects new growth, unable to penetrate due to some blockage in your life."
	},
	{
		"name": "Cherry Street",
		"time": "3 AM",
		"place": "California",
		"description": "I have a lot of dreams involving trying to eat corn but then my teeth keep falling out before I can take a bite. ",
		"meaning": "Teeth are enigmatic dreams symbols that often point towards some sort of loss in our lives. This is why many people associate losing teeth in their dreams and death. While this could be true it is not always the case. In fact most dental dreams symbolize our insecurities, inner weaknesses, poor communication, or a loss of control in your life. According to psychologist Carl Jung, Dreaming about your Teeth Falling Out can be a sign of a major transition or rebirth taking place in your life. If you were struggling to pull out a broken tooth it can alter the meaning. Pulling your own teeth might also bring your attention to speech or lack thereof.  It would mirror trying to force something out of you that you don’t want to admit within yourself."
	},
	{
		"name": "Lace Jones",
		"time": "9 AM (ish)",
		"place": "Toronto",
		"description": "I was left in charge of herding 30 mini ponies through an overnight camps talent show.",
		"meaning": " Horses similar to dogs, are both synonymous with our unconscious instinctual drives and urges. Something that was once wild is now domesticated, a representation of your own inner power that has the potential to become very powerful. Negative associations with the horse encourages the dreamer to investigate some of these repressed or uncontrolled desires. Your interaction with the horse determines if these urges are personally tamed or wild. Your conscience being in charge of these creatures signifies needing to take control of the seemingly “untameable” parts of life."
	},
	{
		"name": "Princess Pearl",
		"time": "10 PM (ish)",
		"place": "New York",
		"description": "I had a dream that I was best friends with Nick Jonas, except he liked me more than I liked him. I was walking through New York and every time I turned a corner he would be there and run at me with open arms and go “EYYY YOUUUUU!!!” in like a really bad chicago accent. It was also around Christmas time so New York was decked out with Holiday decorations.",
		"meaning": "Celebrities that appear in dreams represent our own desires to be noticed, or relating to our own unacknowledged potential that needs to be explored. The specific celebrity that appears in your dream contains hidden elements that alternatively are found within the dreamer.There are not just celebrities but can be images of what you truly want to become as it lacks within A common dream of hanging out with or being friends with a celebrity can be understood more with the exact celebrity you dream of. You will have to decide if this dream is a wishful fantasy,  a craving for attention and notification of others, or reflecting advancement in your life. Starting new jobs or possibly advancing quickly to become noticed might be reflected on this famous person."
	},
	{
		"name": "Doctor Sprinkles",
		"time": "9 AM",
		"place": "Santa Barbara",
		"description": "Recurring nightmare where I am forced to go through an incinerator",
		"meaning": "When fire emerges in our dreams it can either pose a warning or reflect that the dreamer will undergo some sort of inner transformation in their lives. In a positive light fire in our dreams is a symbolic image hinting at destruction of your old aspects in order for the new to flourish. Its ability to illuminate and transform the dreamer will reflect purification of this new energy that you will require. Due to its unpredictable and dangerous nature it can also become a symbol that is highly destructive if it isn’t controlled. Fire encourages the dreamer to explore emotions that are not fully understood yet, perhaps consuming them relating to anger, jealousy, rage or desire that are unconscious. One of the most common dream symbols that tend to appear are both houses and buildings. A powerful image that often reflects the inner architecture of the mind dreamer; a metaphoric substructure of things built and developed over time. This is why when fires emerge in either a house or building it shows that some shift, event or change is about to happen. But where exactly? In most cases inside the house or building each individual floor, room or lower levels often contain its own meaning where this shift or warning is taking place. For example, if the dreamer notices a fire in the bedroom it will point them towards relationships, past childhood experiences, sexual, unconsciousness that is not being made conscious.Alternatively, a fire in your house or a building may indicate new growth or change in our personality, viewpoints, consciousness or behaviors. Fire's unique ability to completely alter what it is in contact with,  so one can depict big changes on the horizon.  If the dreamer notices a Building On Fire it usually relates to “structures” that have been built over the years that are now destroyed. This might mirror relationships, ideals, principles, goals, beliefs or values."
	},
	{
		"name": "Street Cherry",
		"time": "4 AM",
		"place": "California",
		"description": "In middle school, a lot of my dreams revolved around the Walking Dead because I would binge it a lot with my dead. One time I dreamt my mom was turning into a zombie and my dad kept yelling at me to kill her.",
		"meaning": "These brain-oriented flesh eating monsters deliver an important metaphorical message warning the dreamer about something inhuman in human form. Zombies in dreams represent the people who have a decreased level of dopamine in the prefrontal cortex. In fact you might know a couple of zombies in your life. You know the ones who are controlled by limited beliefs, unconscious behaviors, addictions or urges… Maybe you had a glimpse of some fools trampling an old lady to save 15% on a flat screen T.V during a black Friday sale. Or you may be watching too much TV!"
	},
	{
		"name": "Princess Pearl",
		"time": "8 AM (ish)",
		"place": "New York",
		"description": "I dreamt of bright red fields of straw and a deep blue sky. Buried somewhere within China. I conjured up strong wills. We walked for a thousand miles. The ones we passed all knew what we were here for. They didn’t judge us, just watched. His mind was made up but I secretly hoped that I would be enough to change it. My mother was so scared and tired but we knew this was important. Too scared to say no to a man who knew this was what he wanted.",
		"meaning": "Two things in life are certain. Death and taxes. Believe it or not dying in dreams actually has nothing to do with you dying, but rather relating to abrupt endings, transformations or rebirths in your life. Your unconscious speaks to you in a metaphoric language using the theme “dying” as something that used to be, that is no longer. Dreaming about yourself dying might actually be considered a positive thing relating to a major shift taking place in your life. In fact your unsettling dying dream might be a symbolic goodbye to a relationship, a job, or a change of identity – the ego dies all the time only to be reborn again. Maybe on an unconscious level there might be a part of you that is dying or trying to remove yourself from. If you are dreaming about others dying, specifically loved ones, take it as a sign to show them how much you love them! You may not be showing appreciation for your loved ones as much as you would like and you subconsciously feel guilty."
	},
	{
		"name": "Eyelash Cottage",
		"time": "10 AM",
		"place": "New York",
		"description": "I had a dream that I was paving my driveway with tar but then it was time to go to prom so my dad drove me but a few minutes I realized I wasn’t wearing shoes or a corsage and he wouldn’t turn back so I started crying.",
		"meaning": 8.3
	},
	{
		"name": "Street Cherry",
		"time": "11 PM",
		"place": "California",
		"description": "My friends and I were staying in this massive AirBnb mansion. While exploring, we found out the mansion connects to a mall. We walked out the door, and there was a mall!",
		"meaning": 8.1
	},
	{
		"name": "Blues Lawrence",
		"time": "6 AM",
		"place": "California",
		"description": "I was at UC Santa Cruz visiting my friend, but I was also shadowing there as a film student too for some reason. The entire campus was a mic of Great America and Santa Cruz beach boardwalk instead of a normal campus. Alsp, for some reason my film professors were the humanoid versions of Wendy’s and Burger King mascots. They eventually took us to this theater to watch some movie, and then in the middle of the screening all the other kids in my class I was shadowing for, turn around in their seats and remove their skin and suddenly there’s like 10 mini Ronald McDonald’s staring at me with the intent to kill. BUT THEN, the movie theater we were at suddenly starts falling because we were on a plane now for some reason and we end up crashing into the ocean.",
		"meaning": 8.4
	},
	{
		"name": "Princess Pearl",
		"time": "7 AM (ish)",
		"place": "New York",
		"description": "My family and I went on a vacation to Egypt. We had to take single person minecarts to get to each location and I kept jumping out because I was distracted by shiny rocks. We got to our first destination, which was a super old Egyptian temple. My brother took a picture of me posing in front of a really pretty wall.",
		"meaning": 8.3
	},
	{
		"name": "Doctor Sprinkles",
		"time": "7 AM",
		"place": "Santa Barbara",
		"description": "I had a dream that I have breast cancer.",
		"meaning": 7.5
	}
]
